package nc.vo.pu.pub.enumeration;

/**
 * 采购功能节点号中的nodekey枚举
 * 
 * @since 6.0
 * @version 2011-1-25 上午08:53:45
 * @author zhaoyha
 */
public enum PuNodeKey {
  /** 物资申请合并打印 **/
  n4004000001("4004000001"),
  /** 请购单合并打印 **/
  n4004020001("4004020001"),
  /** 请购单拉单 **/
  n4004020022("4004020022"),
  /** 采购订单合并打印 **/
  n4004040001("4004040001"),
  /** 应付款 */
  n40040400AP("1003Z810000000002944"),
  /** 采购订单付款执行情况 **/
  n40040400PE("40040400PE"),
  /** 采购订单拉单 **/
  n40040400RL("40040400RL"),
  /** 到货单合并打印 **/
  n4004080001("4004080001"),
  /** 到货单单表 **/
  n4004080022("4004080022"),
  /** 发票合并打印 **/
  n4004100001("4004100001"),
  /** 发票单表 **/
  n40041000DB("40041000DB"),
  /** 采购结算 **/
  n4004140003("4004140003"),
  /** 消耗汇总结算 **/
  n4004140201("4004140201");
  private String code;

  private PuNodeKey(String code) {
    this.code = code;
  }

  public String code() {
    return this.code;
  }
}
