package nc.vo.pu.pub.enumeration;

/**
 * 采购功能节点号枚举
 * 
 * @since 6.0
 * @version 2011-1-25 上午08:53:45
 * @author zhaoyha
 */
public enum PuNodeCode {
  /** 计划岗物料设置 **/
  n40010515("40010515"),
  /** 采购岗物料设置 **/
  n40010520("40010520"),
  /** 物资申请单 **/
  n40040000("40040000"),
  /** 请购单 **/
  n40040200("40040200"),
  /** 采购订单 **/
  n40040400("40040400"),
  /** 采购订单付款执行情况查询 **/
  n40040414("40040414"),
  /** 采购订单关联功能“付款计划” **/
  n40040418("40040418"),
  /** 到货单 **/
  n40040800("40040800"),
  /** 采购发票 **/
  n40041000("40041000"),
  /** 采购结算 **/
  n40041400("40041400"),
  /** 消耗汇总结算 **/
  n40041402("40041402"),
  /** 暂估处理 **/
  n40041602("40041602"),
  /** 取消暂估 **/
  n40041604("40041604"),
  /** 消耗汇总暂估处理 **/
  n40041606("40041606"),
  /** 消耗汇总取消暂估 **/
  n40041608("40041608"),
  /** 供应商暂估明细查询 **/
  n40041610("40041610");

  private String code;

  private PuNodeCode(String code) {
    this.code = code;
  }

  public String code() {
    return this.code;
  }
}
